app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index()
    {
        return view('customers', [
            'customers' => $this->customerModel->findAll(),
        ]);