app/Controllers/Profile.php

    public function index()
    {
        $userModel = new UserModel2();

        $data = [
            'user' => $userModel->first(),
        ];
---
SELECT *
FROM `users`
 LIMIT 1